{
"About": {
  "Name": "Jacob Ray",
  "Currently": "Computer Engineering Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Jacob Ray. I am a  computer engineering student with a deep interest in embedded systems. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am actively expanding my knowledge and skills as I continually explore my interests, including embedded linux and real-time embedded systems.<br><br>I enjoy learning and am fascinated by technology and the ways in which we are applying it to all sorts of purposes."
},
"Contact": {
  "EMail": "rayj1@spu.edu",
  "Phone": "(206) 496-9796",
  "Portfolio": "https://github.com/JRay350",
  "LinkedIn": "https://www.linkedin.com/in/jacob-ray-231a492bb/",
  "GitHub": "https://github.com/JRay350"
},
"Experience": {
  "ExperienceText": "I'm currently pursuing my studies and exploring my interests, including embedded systems and FPGAs for digital design, in my spare time.",
  "School": "Seattle Pacific University",
  "Major": "Computer Engineering",
  "Graduation": "June 2026",
  "EducationText": "3.99 GPA",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Lab Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C", " C++", " Python", " Verilog", " Multisim"," MATLAB", " Quartus", " Oscilloscopes"],
  "SkillsText": "",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Sallen Key Bandpass Filter Indicator",
    "Desc": "In this project, I designed and optimized a 4th-order Sallen-Key bandpass filter for an IR system, tuned to 17 kHz with at least -12 dB attenuation at 10 kHz and 25 kHz. I first derived a filter based on a transfer function tested in MATLAB, before subsequently simulating in Multisim with an AC sweep and building the filter. From there, I utilized the digital oscilloscopes FRA to test my physical circuit. Afterwards, I integrated a peak detector and comparator to detect passing signals and to trigger an LED indicator that would only pass when the input has the correct frequency. I validated each step of the process with osilloscope analysis, ensuring that the results are what I expected.",
    "GitHubRepo": "",
    "MainImage": "Circuit.jpg",
    "DetailImages": ["Circuit.jpg","FRA.png"]
  },
  "Project2": {
    "Title": "Interesting Project 2",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
}
